slides/2013-04-05-AWS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2013-04-05-AWS</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2013-04-05-AWS"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-06 11:19:43 PDT"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2013-04-05-AWS</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Amazon Web Services</a></li>
<li><a href="#sec-2">2 Grant</a>
<ul>
<li><a href="#sec-2-1">2.1 No crazy</a></li>
</ul>
</li>
<li><a href="#sec-3">3 S3</a></li>
<li><a href="#sec-4">4 <code>s3cmd</code></a>
<ul>
<li><a href="#sec-4-1">4.1 Configuration</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Elastic MapReduce</a></li>
<li><a href="#sec-6">6 Copying Keys</a></li>
<li><a href="#sec-7">7 All Together Now</a>
<ul>
<li><a href="#sec-7-1">7.1 Trade-offs</a></li>
</ul>
</li>
<li><a href="#sec-8">8 Extra Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Amazon Web Services &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Grant &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>$3900 for this class
</li>
<li>Store data in S3
</li>
<li>Use mrjob on EMR
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> No crazy &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>Overcharges go on my credit card!
</li>
<li>Ask me before doing anything not discussed here
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> S3 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="http://aws.amazon.com/s3/">S3</a>: Simple Storage Service
</li>
<li>Can store and share large data files
</li>
<li>Free bandwidth when processing with EMR
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <code>s3cmd</code> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Upload / Download files
</li>
<li><code>s3cmd --configure</code>
</li>
<li><code>s3cmd mb s3://i290-group-name</code>
</li>
<li><code>s3cmd put localfile s3://i290-group-name/data/</code>
</li>
</ul>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Configuration &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>check <code>~jblomo/mrjob.conf</code>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Elastic MapReduce &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><code>python job.py -r emr -c ~jblomo/mrjob.conf s3://i290-group-name/data/file</code>
</li>
<li><code>-r emr</code> : run on EMR instead of localhost
</li>
<li><code>-c ~jblomo/mrjob.conf</code> : use a configuration file
<ul>
<li>5 machines, can change with command line options
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Copying Keys &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>SSH keys are used to connect to server to check status
</li>
<li>Copy my keys, set correct permissions
</li>
</ul>




<pre class="src src-bash">~$ cp ~jblomo/mrjob-common.conf ~/mrjob.conf
~$ chmod 0600 ~/mrjob.conf
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> All Together Now &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">




<pre class="src src-bash">~$ s3cmd put yelp_academic_dataset.json.gz s3://i290-jblomo/data/
# yelp_academic_dataset.json.gz -&gt; s3://i290-jblomo/data/yelp_academic_dataset.json.gz  [1 of 1]
# 127506871 of 127506871   100% in    8s    13.60 MB/s  done

~$ cd datamining290/code/
~/datamining290/code$ python unique_review.py -v -r emr -c ~jblomo/mrjob.conf --output-dir s3://i290-jblomo/output/unique_review/ --no-output s3://i290-jblomo/data/yelp_academic_dataset.json.gz
# ...
# Creating Elastic MapReduce job flow
# ...
# Job flow created with ID: j-EFG48CIR1APW
# ...
# Job launched 60.8s ago, status STARTING: Provisioning Amazon EC2 capacity
# ...
# Job launched 334.4s ago, status RUNNING: Running step (unique_review.jblomo.20130406.171258.267523: Step 1 of 3)
# ...
# map 73% reduce  42%
# ...
# Counters from step 1:
# ...

~/datamining290/code$ s3cmd ls -r s3://i290-jblomo/output/
# ...
# 2013-04-06 18:05        29   s3://i290-jblomo/output/unique_review/part-00005
# ...
</pre>


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Trade-offs &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>Jobs may take 5 minutes to spin up
</li>
<li>Errors are harder to debug because they are mixed in with Hadoop and EMR
     errors
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Extra Notes &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>Cannot overwrite output directory: choose a new one for each run
</li>
<li>Errors may be hard to debug. Run locally with a sample of your data
</li>
<li>Output from job will be split into files, recall the Hadoop video lecture
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-06 11:19:43 PDT</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
